Revit 2024 API
ImageView Class
 Class for ImageView views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ImageView : ViewDrafting
Visual Basic
Public Class ImageView _
	Inherits ViewDrafting
Visual C++
public ref class ImageView : public ViewDrafting
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewDrafting
 Autodesk.Revit.DB.ImageView
See Also
ImageView Members
Autodesk.Revit.DB Namespace